#+TITLE: High-Performance Matrix Multiplication in Rust
#+AUTHOR: Olav
#+DATE: 2025-10-17
#+STARTUP: overview
#+OPTIONS: toc:nil num:nil

* Live Demo: Naive Performance

#+BEGIN_SRC sh :results output :exports both
cd /home/olav/dev/rust/matmul

cargo +nightly bench --bench naive_128

#+END_SRC

#+RESULTS:
: naive_128               time:   [2.3472 ms 2.3670 ms 2.3909 ms]
:                         change: [+1.2378% +2.1371% +3.1845%] (p = 0.00 < 0.05)
:                         Performance has regressed.
: Found 11 outliers among 100 measurements (11.00%)
:   4 (4.00%) high mild
:   7 (7.00%) high severe
: 

* Block Size Analysis

#+BEGIN_SRC sh :results output :exports both
cd /home/olav/dev/rust/matmul
cargo run --release --bin matmul -- --blocked
#+END_SRC

#+RESULTS:
#+begin_example
Blocked Matrix Multiplication Comparison
size,algorithm,block_size,time_ns,gflops
256,naive,0,24233658,1.384621
256,optimized,0,13479549,2.489284
256,blocked,32,18253015,1.838295
256,blocked,48,17011042,1.972509
256,blocked,64,20912923,1.604483
256,blocked,96,20753875,1.616779
256,blocked,128,19576060,1.714054
256,blocked_ultimate,64,9434899,3.556417
512,naive,0,557058558,0.481880
512,optimized,0,105669088,2.540340
512,blocked,32,147348918,1.821767
512,blocked,48,147408844,1.821027
512,blocked,64,183439190,1.463348
512,blocked,96,182888670,1.467753
512,blocked,128,174111424,1.541745
512,blocked_ultimate,64,74898344,3.583997
768,naive,0,1530656653,0.591883
768,optimized,0,357349543,2.535248
768,blocked,32,479525662,1.889304
768,blocked,48,512926613,1.766275
768,blocked,64,542397196,1.670307
768,blocked,96,613639509,1.476387
768,blocked,128,583112422,1.553679
768,blocked_ultimate,64,248575943,3.644639
1024,naive,0,4736583120,0.453382
1024,optimized,0,854573451,2.512930
1024,blocked,32,1191180442,1.802820
1024,blocked,48,1229022280,1.747311
1024,blocked,64,1322480954,1.623830
1024,blocked,96,1458849133,1.472040
1024,blocked,128,1381641902,1.554298
1024,blocked_ultimate,64,614751652,3.493254
#+end_example

*Key findings*:
- Block size 32-64 typically optimal for this hardware (L1d = 37KB)
- Speedup increases with matrix size
- Combined optimizations (blocked + SIMD + column-major) provide best results
- Performance varies significantly with hardware specs

